app/controllers/students_controller.rb

  def set_students
    @students = Student.find_by(params[:id])
---
SELECT  "students".* FROM "students" WHERE (1) LIMIT ?  [["LIMIT", 1]]